###################################################################

# Created by write_sdc on Fri May 7 21:05:24 2021

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports {y[31]}]
set_load -pin_load 1 [get_ports {y[30]}]
set_load -pin_load 1 [get_ports {y[29]}]
set_load -pin_load 1 [get_ports {y[28]}]
set_load -pin_load 1 [get_ports {y[27]}]
set_load -pin_load 1 [get_ports {y[26]}]
set_load -pin_load 1 [get_ports {y[25]}]
set_load -pin_load 1 [get_ports {y[24]}]
set_load -pin_load 1 [get_ports {y[23]}]
set_load -pin_load 1 [get_ports {y[22]}]
set_load -pin_load 1 [get_ports {y[21]}]
set_load -pin_load 1 [get_ports {y[20]}]
set_load -pin_load 1 [get_ports {y[19]}]
set_load -pin_load 1 [get_ports {y[18]}]
set_load -pin_load 1 [get_ports {y[17]}]
set_load -pin_load 1 [get_ports {y[16]}]
set_load -pin_load 1 [get_ports {y[15]}]
set_load -pin_load 1 [get_ports {y[14]}]
set_load -pin_load 1 [get_ports {y[13]}]
set_load -pin_load 1 [get_ports {y[12]}]
set_load -pin_load 1 [get_ports {y[11]}]
set_load -pin_load 1 [get_ports {y[10]}]
set_load -pin_load 1 [get_ports {y[9]}]
set_load -pin_load 1 [get_ports {y[8]}]
set_load -pin_load 1 [get_ports {y[7]}]
set_load -pin_load 1 [get_ports {y[6]}]
set_load -pin_load 1 [get_ports {y[5]}]
set_load -pin_load 1 [get_ports {y[4]}]
set_load -pin_load 1 [get_ports {y[3]}]
set_load -pin_load 1 [get_ports {y[2]}]
set_load -pin_load 1 [get_ports {y[1]}]
set_load -pin_load 1 [get_ports {y[0]}]
create_clock [get_ports clk]  -period 200  -waveform {0 100}
group_path -name FEEDTHROUGH  -from [list [get_ports {x[15]}] [get_ports {x[14]}] [get_ports {x[13]}] [get_ports {x[12]}] [get_ports {x[11]}] [get_ports {x[10]}] [get_ports {x[9]}] [get_ports {x[8]}] [get_ports {x[7]}] [get_ports {x[6]}] [get_ports {x[5]}] [get_ports {x[4]}] [get_ports {x[3]}] [get_ports {x[2]}] [get_ports {x[1]}] [get_ports {x[0]}] [get_ports reset]]  -to [list [get_ports {y[31]}] [get_ports {y[30]}] [get_ports {y[29]}] [get_ports {y[28]}] [get_ports {y[27]}] [get_ports {y[26]}] [get_ports {y[25]}] [get_ports {y[24]}] [get_ports {y[23]}] [get_ports {y[22]}] [get_ports {y[21]}] [get_ports {y[20]}] [get_ports {y[19]}] [get_ports {y[18]}] [get_ports {y[17]}] [get_ports {y[16]}] [get_ports {y[15]}] [get_ports {y[14]}] [get_ports {y[13]}] [get_ports {y[12]}] [get_ports {y[11]}] [get_ports {y[10]}] [get_ports {y[9]}] [get_ports {y[8]}] [get_ports {y[7]}] [get_ports {y[6]}] [get_ports {y[5]}] [get_ports {y[4]}] [get_ports {y[3]}] [get_ports {y[2]}] [get_ports {y[1]}] [get_ports {y[0]}]]
group_path -name REGIN  -from [list [get_ports {x[15]}] [get_ports {x[14]}] [get_ports {x[13]}] [get_ports {x[12]}] [get_ports {x[11]}] [get_ports {x[10]}] [get_ports {x[9]}] [get_ports {x[8]}] [get_ports {x[7]}] [get_ports {x[6]}] [get_ports {x[5]}] [get_ports {x[4]}] [get_ports {x[3]}] [get_ports {x[2]}] [get_ports {x[1]}] [get_ports {x[0]}] [get_ports reset]]
group_path -name REGOUT  -to [list [get_ports {y[31]}] [get_ports {y[30]}] [get_ports {y[29]}] [get_ports {y[28]}] [get_ports {y[27]}] [get_ports {y[26]}] [get_ports {y[25]}] [get_ports {y[24]}] [get_ports {y[23]}] [get_ports {y[22]}] [get_ports {y[21]}] [get_ports {y[20]}] [get_ports {y[19]}] [get_ports {y[18]}] [get_ports {y[17]}] [get_ports {y[16]}] [get_ports {y[15]}] [get_ports {y[14]}] [get_ports {y[13]}] [get_ports {y[12]}] [get_ports {y[11]}] [get_ports {y[10]}] [get_ports {y[9]}] [get_ports {y[8]}] [get_ports {y[7]}] [get_ports {y[6]}] [get_ports {y[5]}] [get_ports {y[4]}] [get_ports {y[3]}] [get_ports {y[2]}] [get_ports {y[1]}] [get_ports {y[0]}]]
set_input_delay -clock clk  -max 90  [get_ports {x[15]}]
set_input_delay -clock clk  -max 90  [get_ports {x[14]}]
set_input_delay -clock clk  -max 90  [get_ports {x[13]}]
set_input_delay -clock clk  -max 90  [get_ports {x[12]}]
set_input_delay -clock clk  -max 90  [get_ports {x[11]}]
set_input_delay -clock clk  -max 90  [get_ports {x[10]}]
set_input_delay -clock clk  -max 90  [get_ports {x[9]}]
set_input_delay -clock clk  -max 90  [get_ports {x[8]}]
set_input_delay -clock clk  -max 90  [get_ports {x[7]}]
set_input_delay -clock clk  -max 90  [get_ports {x[6]}]
set_input_delay -clock clk  -max 90  [get_ports {x[5]}]
set_input_delay -clock clk  -max 90  [get_ports {x[4]}]
set_input_delay -clock clk  -max 90  [get_ports {x[3]}]
set_input_delay -clock clk  -max 90  [get_ports {x[2]}]
set_input_delay -clock clk  -max 90  [get_ports {x[1]}]
set_input_delay -clock clk  -max 90  [get_ports {x[0]}]
set_input_delay -clock clk  -max 90  [get_ports reset]
set_output_delay -clock clk  -max 90  [get_ports {y[31]}]
set_output_delay -clock clk  -max 90  [get_ports {y[30]}]
set_output_delay -clock clk  -max 90  [get_ports {y[29]}]
set_output_delay -clock clk  -max 90  [get_ports {y[28]}]
set_output_delay -clock clk  -max 90  [get_ports {y[27]}]
set_output_delay -clock clk  -max 90  [get_ports {y[26]}]
set_output_delay -clock clk  -max 90  [get_ports {y[25]}]
set_output_delay -clock clk  -max 90  [get_ports {y[24]}]
set_output_delay -clock clk  -max 90  [get_ports {y[23]}]
set_output_delay -clock clk  -max 90  [get_ports {y[22]}]
set_output_delay -clock clk  -max 90  [get_ports {y[21]}]
set_output_delay -clock clk  -max 90  [get_ports {y[20]}]
set_output_delay -clock clk  -max 90  [get_ports {y[19]}]
set_output_delay -clock clk  -max 90  [get_ports {y[18]}]
set_output_delay -clock clk  -max 90  [get_ports {y[17]}]
set_output_delay -clock clk  -max 90  [get_ports {y[16]}]
set_output_delay -clock clk  -max 90  [get_ports {y[15]}]
set_output_delay -clock clk  -max 90  [get_ports {y[14]}]
set_output_delay -clock clk  -max 90  [get_ports {y[13]}]
set_output_delay -clock clk  -max 90  [get_ports {y[12]}]
set_output_delay -clock clk  -max 90  [get_ports {y[11]}]
set_output_delay -clock clk  -max 90  [get_ports {y[10]}]
set_output_delay -clock clk  -max 90  [get_ports {y[9]}]
set_output_delay -clock clk  -max 90  [get_ports {y[8]}]
set_output_delay -clock clk  -max 90  [get_ports {y[7]}]
set_output_delay -clock clk  -max 90  [get_ports {y[6]}]
set_output_delay -clock clk  -max 90  [get_ports {y[5]}]
set_output_delay -clock clk  -max 90  [get_ports {y[4]}]
set_output_delay -clock clk  -max 90  [get_ports {y[3]}]
set_output_delay -clock clk  -max 90  [get_ports {y[2]}]
set_output_delay -clock clk  -max 90  [get_ports {y[1]}]
set_output_delay -clock clk  -max 90  [get_ports {y[0]}]
set_input_transition -max 0.1  [get_ports {x[15]}]
set_input_transition -min 0.1  [get_ports {x[15]}]
set_input_transition -max 0.1  [get_ports {x[14]}]
set_input_transition -min 0.1  [get_ports {x[14]}]
set_input_transition -max 0.1  [get_ports {x[13]}]
set_input_transition -min 0.1  [get_ports {x[13]}]
set_input_transition -max 0.1  [get_ports {x[12]}]
set_input_transition -min 0.1  [get_ports {x[12]}]
set_input_transition -max 0.1  [get_ports {x[11]}]
set_input_transition -min 0.1  [get_ports {x[11]}]
set_input_transition -max 0.1  [get_ports {x[10]}]
set_input_transition -min 0.1  [get_ports {x[10]}]
set_input_transition -max 0.1  [get_ports {x[9]}]
set_input_transition -min 0.1  [get_ports {x[9]}]
set_input_transition -max 0.1  [get_ports {x[8]}]
set_input_transition -min 0.1  [get_ports {x[8]}]
set_input_transition -max 0.1  [get_ports {x[7]}]
set_input_transition -min 0.1  [get_ports {x[7]}]
set_input_transition -max 0.1  [get_ports {x[6]}]
set_input_transition -min 0.1  [get_ports {x[6]}]
set_input_transition -max 0.1  [get_ports {x[5]}]
set_input_transition -min 0.1  [get_ports {x[5]}]
set_input_transition -max 0.1  [get_ports {x[4]}]
set_input_transition -min 0.1  [get_ports {x[4]}]
set_input_transition -max 0.1  [get_ports {x[3]}]
set_input_transition -min 0.1  [get_ports {x[3]}]
set_input_transition -max 0.1  [get_ports {x[2]}]
set_input_transition -min 0.1  [get_ports {x[2]}]
set_input_transition -max 0.1  [get_ports {x[1]}]
set_input_transition -min 0.1  [get_ports {x[1]}]
set_input_transition -max 0.1  [get_ports {x[0]}]
set_input_transition -min 0.1  [get_ports {x[0]}]
set_input_transition -max 0.1  [get_ports reset]
set_input_transition -min 0.1  [get_ports reset]
